[
 {
   "Question_type": "MC (Multiple choice)",
   "Question_id": 1,
   "Question_text": "Every morning, Rajeev spends an hour alone drawing a portrait from a photograph in the day’s newspaper to improve his portraiture skills (skills drawing a portrait). Yet, despite a year of practice, his drawing skills do not seem to improved. Why might simply practicing a portrait a day not yield an improvement?",
   "Correct_answer_choice": "A",
   "Choice_A_text": "Rajeev is getting a lot of practice, but he should ask an art instructor each day for feedback on how well he drew the day’s portrait",
   "Students_select_A": 20,
   "Choice_B_text": "Rajeev is practicing different tasks every day, so his practice isn’t deliberate. He should try and draw the same portrait every day",
   "Students_select_B": 4,
   "Choice_C_text": "Rajeev is practicing for too short a time. He should practice for a longer period of time",
   "Students_select_C": 0,
   "Choice_D_text": "Rajeev’s practice sessions are always in the morning; he should try varying his practice schedule",
   "Students_select_D": 0
 },
 {
   "Question_type": "SA (Select all that apply)",
   "Question_id": 2,
   "Question_text": "Dan wants to improve his golf game. Every day, he practices one golf stroke for an hour, and records his practice session on video. After his practice, he watches the recording, and plans on what changes to make the next day. Assume he has no other golf instruction. Is Dan engaged in deliberate practice? Why?",
   "Correct_answer_choice": "B,C",
   "Choice_A_text": "Yes, because he is practicing a specific skill with rich feedback",
   "Students_select_A": 1,
   "Choice_B_text": "No, because he is not getting task feedback from an external agent",
   "Students_select_B": 22,
   "Choice_C_text": "No, because he is not able to practice corrections immediately (he must wait till the next day)",
   "Students_select_C": 14,
   "Choice_D_text": "Yes, because he is practicing a specific skill with knowledge of the results of his previous attempts",
   "Students_select_D": 2
 },
 {
   "Question_type": "SA",
   "Question_id": 3,
   "Question_text": "Mark is learning to play the guitar. After long hours of practice, he mastered playing his favorite song. Write one growth-mindset building feedback his instructor could give him.",
   "Correct_answer_choice": "B,D",
   "Choice_A_text": "You are a talented musician",
   "Students_select_A": 1,
   "Choice_B_text": "Great persistent on your learning",
   "Students_select_B": 23,
   "Choice_C_text": "Amazing job!",
   "Students_select_C": 5,
   "Choice_D_text": "Well done keeping the right rhythm",
   "Students_select_D": 3
 },
 {
   "Question_type": "MC",
   "Question_id": 4,
   "Question_text": "Many teachers who have used Jigsaw report that students start to see themselves in a different light -- as more competent, likable, and positive contributors to the classroom. Does the Jigsaw method create a growth-intelligence mindset?",
   "Correct_answer_choice": "C",
   "Choice_A_text": "Yes, because it shows students that they can grow in their abilities",
   "Students_select_A": 7,
   "Choice_B_text": "Yes, because it shows students that other students in their group can grow in their abilities",
   "Students_select_B": 2,
   "Choice_C_text": "No, because it doesn’t implicate how the brain works, and the malleable nature of intelligence",
   "Students_select_C": 14,
   "Choice_D_text": "No, because while it shows students that they can grow abilities in one subject, it leaves them uncertain about whether they can grow abilities in other subjects",
   "Students_select_D": 1
 }
]